#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_project_service.required_apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=plenary-chalice-463308-g6/cloudresourcemanager.googleapis.com]
google_project_service.required_apis["compute.googleapis.com"]: Refreshing state... [id=plenary-chalice-463308-g6/compute.googleapis.com]
google_project_service.required_apis["iap.googleapis.com"]: Refreshing state... [id=plenary-chalice-463308-g6/iap.googleapis.com]
google_service_account.this: Refreshing state... [id=projects/plenary-chalice-463308-g6/serviceAccounts/k3s-vm-sa@plenary-chalice-463308-g6.iam.gserviceaccount.com]
google_compute_global_address.this: Refreshing state... [id=projects/plenary-chalice-463308-g6/global/addresses/k3s-ip]
google_compute_health_check.this: Refreshing state... [id=projects/plenary-chalice-463308-g6/global/healthChecks/k3s-healthcheck]
google_project_iam_member.monitoring_writer: Refreshing state... [id=plenary-chalice-463308-g6/roles/monitoring.metricWriter/serviceAccount:k3s-vm-sa@plenary-chalice-463308-g6.iam.gserviceaccount.com]
google_project_iam_member.log_writer: Refreshing state... [id=plenary-chalice-463308-g6/roles/logging.logWriter/serviceAccount:k3s-vm-sa@plenary-chalice-463308-g6.iam.gserviceaccount.com]
google_compute_network.this: Refreshing state... [id=projects/plenary-chalice-463308-g6/global/networks/k3s-network]
google_compute_router.this: Refreshing state... [id=projects/plenary-chalice-463308-g6/regions/europe-west1/routers/k3s-router]
google_compute_firewall.iap: Refreshing state... [id=projects/plenary-chalice-463308-g6/global/firewalls/allow-iap]
google_compute_subnetwork.this: Refreshing state... [id=projects/plenary-chalice-463308-g6/regions/europe-west1/subnetworks/k3s-subnet]
google_compute_firewall.healthcheck: Refreshing state... [id=projects/plenary-chalice-463308-g6/global/firewalls/allow-healthchecks]
google_compute_router_nat.this: Refreshing state... [id=plenary-chalice-463308-g6/europe-west1/k3s-router/k3s-nat]
google_compute_instance.this: Refreshing state... [id=projects/plenary-chalice-463308-g6/zones/europe-west1-b/instances/k3s-vm]
google_compute_instance_group.this: Refreshing state... [id=projects/plenary-chalice-463308-g6/zones/europe-west1-b/instanceGroups/k3s-instance-group]
google_compute_backend_service.this: Refreshing state... [id=projects/plenary-chalice-463308-g6/global/backendServices/k3s-backend-service]
google_compute_url_map.this: Refreshing state... [id=projects/plenary-chalice-463308-g6/global/urlMaps/k3s-lb]
google_compute_target_http_proxy.this: Refreshing state... [id=projects/plenary-chalice-463308-g6/global/targetHttpProxies/k3s-http-lb]
google_compute_global_forwarding_rule.this: Refreshing state... [id=projects/plenary-chalice-463308-g6/global/forwardingRules/k3s-http-rule]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.this must be replaced
-/+ resource "google_compute_instance" "this" {
      ~ cpu_platform               = "Intel Broadwell" -> (known after apply)
      ~ creation_timestamp         = "2025-06-21T13:34:54.788-07:00" -> (known after apply)
      ~ current_status             = "RUNNING" -> (known after apply)
      - enable_display             = false -> null
      ~ id                         = "projects/plenary-chalice-463308-g6/zones/europe-west1-b/instances/k3s-vm" -> (known after apply)
      ~ instance_id                = "8814976948506372481" -> (known after apply)
      ~ label_fingerprint          = "vezUS-42LLM=" -> (known after apply)
      - labels                     = {} -> null
      ~ metadata_fingerprint       = "zQu61FIWPoo=" -> (known after apply)
      ~ metadata_startup_script    = <<-EOT # forces replacement
            #!/usr/bin/env bash
            set -euo pipefail
            
            # --- Configuration ---
            export K3S_VERSION="v1.32.5+k3s1"
            export LOG_FILE="/var/log/setup.log"
            export MANIFESTS_DIRECTORY="/var/lib/rancher/k3s/server/manifests"
            
          - # --- Logging ---
          - exec > >(tee "$LOG_FILE") 2>&1
          + # --------Logging-----------
          + exec > >(tee -a "$LOG_FILE")
          + exec 2>&1
            
          + log() {
          +   echo "[$(date '+%Y-%m-%d %H:%M:%S')] $1"
          + }
          + # --------------------------
          + 
            # --- Update packages ---
          - echo "Updating system packages..."
          + log "Updating system packages..."
            apt-get update && apt-get upgrade -y
            
          - 
            # --- k3s Installation ---
          - echo "Installing k3s version $K3S_VERSION..."
          + log "Installing k3s version $K3S_VERSION..."
            curl -sfL https://get.k3s.io | INSTALL_K3S_VERSION="$K3S_VERSION" sh -s - \
              --disable traefik \
              --disable local-storage \
              --disable metrics-server
            
            # --- k3s Configuration (only root has access to kubeconfig)---
          - echo "Configuring k3s kubeconfig permissions..."
          + log "Configuring k3s kubeconfig permissions..."
            cat <<EOF > /etc/rancher/k3s/config.yaml
            write-kubeconfig-mode: "0600"
            EOF
            
            systemctl stop k3s
            sleep 5
            systemctl start k3s
            
            # Wait for k3s static manifests directory to be ready
            # Reference: https://docs.k3s.io/installation/packaged-components?_highlight=addons#helm-addons
          - echo "Waiting for directory '$MANIFESTS_DIRECTORY' to be created..."
          + log "Waiting for directory '$MANIFESTS_DIRECTORY' to be created..."
            while [ ! -d "$MANIFESTS_DIRECTORY" ]; do
                echo "Directory not found, waiting 2 seconds..."
                sleep 2
            done
            
            # --- Kyverno Installation ---
          - echo "Installing Kyverno and adding policy repo..."
          + log "Installing Kyverno and adding policy repo..."
            cat <<EOF > /var/lib/rancher/k3s/server/manifests/kyverno.yaml
            apiVersion: helm.cattle.io/v1
            kind: HelmChart
            metadata:
              name: kyverno
              namespace: kube-system
            spec:
              repo: https://kyverno.github.io/kyverno/
              chart: kyverno
              targetNamespace: kyverno
              createNamespace: true
              version: 3.4.3
            ---
            apiVersion: kyverno.io/v1
            kind: ClusterPolicy
            metadata:
              name: allow-only-node-http
            spec:
              validationFailureAction: Enforce
              background: true
              rules:
                - name: allow-only-node-http
                  match:
                    resources:
                      kinds:
                        - Pod
                  validate:
                    message: "Only images from ghcr.io/jdavid77/node-http are allowed."
                    pattern:
                      spec:
                        containers:
                          - image: "ghcr.io/jdavid77/node-http*"
            EOF
            
          - echo "Done!"
          + log "Done!"
        EOT
      + min_cpu_platform           = (known after apply)
        name                       = "k3s-vm"
      - resource_policies          = [] -> null
      ~ self_link                  = "https://www.googleapis.com/compute/v1/projects/plenary-chalice-463308-g6/zones/europe-west1-b/instances/k3s-vm" -> (known after apply)
        tags                       = [
            "k3s",
        ]
      ~ tags_fingerprint           = "5HvneqGJ8DY=" -> (known after apply)
        # (11 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                     = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256      = (known after apply)
          - force_attach                    = false -> null
          ~ guest_os_features               = [
              - "VIRTIO_SCSI_MULTIQUEUE",
              - "SEV_CAPABLE",
              - "SEV_SNP_CAPABLE",
              - "SEV_LIVE_MIGRATABLE",
              - "SEV_LIVE_MIGRATABLE_V2",
              - "IDPF",
              - "TDX_CAPABLE",
              - "UEFI_COMPATIBLE",
              - "GVNIC",
            ] -> (known after apply)
          + kms_key_self_link               = (known after apply)
          ~ source                          = "https://www.googleapis.com/compute/v1/projects/plenary-chalice-463308-g6/zones/europe-west1-b/disks/k3s-vm" -> (known after apply)
            # (6 unchanged attributes hidden)

          ~ initialize_params {
              ~ architecture                = "X86_64" -> (known after apply)
              - enable_confidential_compute = false -> null
              ~ image                       = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2204-jammy-v20250615" -> "ubuntu-os-cloud/ubuntu-2204-lts"
              ~ labels                      = {} -> (known after apply)
              ~ provisioned_iops            = 0 -> (known after apply)
              ~ provisioned_throughput      = 0 -> (known after apply)
              - resource_manager_tags       = {} -> null
              ~ resource_policies           = [] -> (known after apply)
              + snapshot                    = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }

      ~ confidential_instance_config (known after apply)

      ~ guest_accelerator (known after apply)

      ~ network_interface {
          ~ internal_ipv6_prefix_length = 0 -> (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          ~ name                        = "nic0" -> (known after apply)
          + network_attachment          = (known after apply)
          ~ network_ip                  = "10.0.0.2" -> (known after apply)
          - queue_count                 = 0 -> null
          ~ stack_type                  = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork_project          = "plenary-chalice-463308-g6" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ reservation_affinity (known after apply)

      ~ scheduling (known after apply)
      - scheduling {
          - automatic_restart           = true -> null
          - availability_domain         = 0 -> null
          - min_node_cpus               = 0 -> null
          - on_host_maintenance         = "MIGRATE" -> null
          - preemptible                 = false -> null
          - provisioning_model          = "STANDARD" -> null
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_compute_instance_group.this will be updated in-place
  ~ resource "google_compute_instance_group" "this" {
        id          = "projects/plenary-chalice-463308-g6/zones/europe-west1-b/instanceGroups/k3s-instance-group"
      ~ instances   = [
          - "https://www.googleapis.com/compute/v1/projects/plenary-chalice-463308-g6/zones/europe-west1-b/instances/k3s-vm",
        ] -> (known after apply)
        name        = "k3s-instance-group"
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @Jdavid77, Action: `pull_request`*